app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = ::Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios"

  def create
    @funcionario = Funcionario.new(set_params)
    if @funcionario.save
---
INSERT INTO "funcionarios" ("nome", "matricula", "cargo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Lucas"], ["matricula", "test"], ["cargo", "assessor"], ["created_at", "2018-10-17 14:31:20.861433"], ["updated_at", "2018-10-17 14:31:20.861433"]]

  def update
    if @funcionario.update(set_params)
---
UPDATE "funcionarios" SET "matricula" = ?, "updated_at" = ? WHERE "funcionarios"."id" = ?  [["matricula", "12345"], ["updated_at", "2018-10-17 14:29:07.826325"], ["id", 3]]

  def set_funcionario
    @funcionario = Funcionario.find(params[:id])
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]